{
  "categoryOverride": {
    "HB2176": "Social Media Age/Access"
  },
  "nicknames": {
    "SB1014": "Phone-Free Schools Act",
    "HB1814": "Cell Phones in Schools",
    "HB1238": "Mobile Device Restrictions During Instruction",
    "SB229": "Cell Phone Lockable Bag Pilot Program",
    "SB22": "Protection of Minors on Social Media",
    "HB1430": "Protection of Minors on Social Media (House companion)",
    "HB2215": "Age Verification & Online Safety",
    "HB1729": "Children's Online Safety",
    "SB603": "Internet Protections for Minors",
    "HB1513": "Liability for Material Harmful to Minors",
    "SB378": "Student Data Privacy and Protection",
    "HB811": "Deepfake Liability",
    "HB2217": "Recess and Lunch Periods",
    "HB1669": "Free-Play Recess",
    "HB1873": "Childhood Independence",
    "HB1098": "Alicia's Law (Internet Crimes Against Children)",
    "HB939": "Child Content Creator Protections",
    "SB112": "Consumer Data Privacy Act",
    "HB78": "Consumer Data Privacy Act (House companion)",
    "SB631": "Parental Consent for School Virtual Mental Health",
    "SB293": "AI in the Workforce",
    "HB2176": "Social Media Literacy Education"
  },
  "hide": [
    "HB849", "SB361",
    "HB1200", "SB756", "HB165", "HB1217", "HB434", "HB107",
    "SB1079", "SB626", "HB2213", "HB1479",
    "HB416", "HB1188", "HB2153",
    "SB424", "HB660", "SB194", "SB113", "HB1611",
    "HB1396", "SB1174"
  ],
  "descriptions": {
    "SB1014": "Requires all PA public schools to adopt a bell-to-bell phone-free policy by 2027–28. Covers the entire school day including lunch and recess. Schools choose the method (pouches, lockers, etc.) but must restrict possession, not just use. Exceptions for medical needs, IEPs, and English language learners. Passed the Senate 46-1.",
    "HB1814": "Bans cell phone possession during the school day and requires physical storage — either a lockbox/secure location or a locking pouch carried by the student. More prescriptive than SB1014, which lets districts choose the restriction method. Only exceptions: volunteer firefighters/EMS members and students with an immediate family member's medical condition, both requiring administrator approval.",
    "HB1238": "Restricts student possession and use of mobile devices during instructional time in K-12 public schools. Sponsored by Rep. Barbara Gleim. Narrower in scope than SB1014 and HB1814, which cover the entire school day bell-to-bell — this bill focuses specifically on instruction time only.",
    "SB229": "Creates a voluntary two-year pilot program providing grants for schools to purchase lockable phone pouches (like Yondr). Participating schools must track and report changes in student mental health, bullying, violence, and academics. Aims for geographic diversity across the state. Expires December 2026.",
    "SB22": "Prohibits social media accounts for children under 16 without parental consent. Parents can revoke consent and demand account closure. Bans platforms from mining or selling minors' data and from showing content that could harm their mental health. Enforced by the Attorney General with civil penalties; parents can also sue.",
    "HB1430": "House companion to SB22. Requires parental consent for minors under 16 on social media, bans targeted advertising to kids, and prohibits data collection on minors. Same core framework as SB22 but introduced in the House.",
    "HB2215": "Requires age verification on AI chatbots and platforms hosting harmful content. Covered platforms must freeze existing minor accounts and verify age for new ones. Also creates the offenses of prohibited promotion of sexually explicit conduct and violence to minors, with criminal penalties.",
    "HB1729": "Establishes children's online safety protections under PA criminal code. Creates a duty-of-care framework requiring platforms to protect minors from harmful content and exploitative design features.",
    "SB603": "Requires websites where more than one-third of content is harmful to minors to implement age verification (government ID, digital ID, or bank info). Platforms cannot retain identifying data after verification. Exceptions for news organizations and ISPs. Takes effect 90 days after passage.",
    "HB1513": "Creates civil liability for internet publishers and distributors of material harmful to minors. Websites with more than 33% harmful content must verify user ages. Failure to comply can result in treble damages. ISPs, search engines, and cloud providers are exempt.",
    "SB378": "Comprehensive student data privacy law. Requires the Dept. of Education to appoint a chief data privacy officer. Schools must adopt security measures, designate a data manager, and file annual reports. Defines student data broadly (including biometrics) and limits how ed-tech companies can collect, use, and share it. Includes penalties for noncompliance.",
    "HB811": "Creates civil liability for AI-generated deepfakes that misrepresent someone. Builds on PA's 2024 deepfake law (Act 125) and 2025 Act 35, which criminalized deepfakes with fraudulent intent. Includes specific protections for minors against AI-generated CSAM and non-consensual intimate images.",
    "HB1098": "Named for Alicia Kozakiewicz, who was abducted by an internet predator at age 13. Establishes an ICAC (Internet Crimes Against Children) program within PCCD, funded by grants for state and local task forces to investigate and prosecute technology-facilitated child exploitation. Supplements existing federal ICAC funding.",
    "HB2217": "Requires all PA public schools — K through 12 — to provide at least 30 minutes of recess and 30 minutes for lunch every school day. Notably extends the recess requirement to middle and high school students, not just elementary.",
    "HB1669": "Mandates at least 30 minutes of daily unstructured free-play recess for elementary students. Focuses specifically on child-directed play rather than organized activities, citing benefits for physical health, concentration, and social-emotional development.",
    "HB1873": "Amends child abuse and neglect definitions so that parents aren't penalized for allowing age-appropriate independence — such as walking to school, playing outside unsupervised, or babysitting. Requires prosecutors to show willful or reckless disregard for obvious danger, not just a child being unsupervised. Aims to curb CPS overreach that disproportionately impacts non-white and working families.",
    "HB939": "Extends child labor protections to minors who are social media content creators. Requires parents or guardians to set aside a portion of the child's earnings in a trust account, inaccessible until the child turns 18. Part of a multi-state trend following Illinois and California kidfluencer laws.",
    "SB112": "Pennsylvania's comprehensive Consumer Data Privacy Act. Establishes rules for how companies collect, process, and sell personal data, with heightened protections for children's data. Creates duties for data controllers and processors, with penalties for violations. Companion to HB78.",
    "HB78": "House companion to SB112. Passed the House unanimously. Same framework: comprehensive consumer data privacy protections with specific provisions for children's data, duties for data controllers and processors, and enforcement penalties.",
    "SB631": "Requires schools to get written parental consent before providing any virtual mental health services to students under 18 — including online peer support, non-professional counseling, and AI-based behavioral health tools. Schools must use a standardized consent form renewed annually.",
    "SB293": "Commissions a study on the impact of artificial intelligence on Pennsylvania's workforce and education system, including how AI tools are being used in schools and potential effects on student learning.",
    "HB2176": "Requires PA public schools to provide social media literacy education. Covers topics such as algorithmic manipulation, data privacy, identifying misinformation, and healthy digital habits. Sponsored by Rep. Jim Prokopiak with 14 co-sponsors."
  },
  "notes": {}
}
